## PLAN
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.check-scheduler-event will be created
+   resource "aws_cloudwatch_event_rule" "check-scheduler-event" {
+       arn                 = (known after apply)
+       description         = " cronjob schedule"
+       id                  = (known after apply)
+       is_enabled          = true
+       name                = "-cronjob-check-scheduler-event"
+       schedule_expression = "cron(* * * * ? *)"
    }

  # aws_cloudwatch_event_target.sns will be created
+   resource "aws_cloudwatch_event_target" "sns" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       rule      = "-cronjob-check-scheduler-event"
+       target_id = "SendToSNS"
    }

  # aws_sns_topic.default will be created
+   resource "aws_sns_topic" "default" {
+       arn          = (known after apply)
+       display_name = " cronjob"
+       id           = (known after apply)
+       name         = (known after apply)
+       policy       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   arn = (known after apply)
+   id  = (known after apply)
```
-----

## PLAN
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.check-scheduler-event will be created
+   resource "aws_cloudwatch_event_rule" "check-scheduler-event" {
+       arn                 = (known after apply)
+       description         = " cronjob schedule"
+       id                  = (known after apply)
+       is_enabled          = true
+       name                = "-cronjob-check-scheduler-event"
+       schedule_expression = "cron(* * * * ? *)"
    }

  # aws_cloudwatch_event_target.sns will be created
+   resource "aws_cloudwatch_event_target" "sns" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       rule      = "-cronjob-check-scheduler-event"
+       target_id = "SendToSNS"
    }

  # aws_sns_topic.default will be created
+   resource "aws_sns_topic" "default" {
+       arn          = (known after apply)
+       display_name = " cronjob"
+       id           = (known after apply)
+       name         = (known after apply)
+       policy       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   arn = (known after apply)
+   id  = (known after apply)
```
-----

Merge to master to apply all of the above